chore: add diagrams in README
